DataProcessors/МониторРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>МониторРуководителя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыКлиентов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПлан</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаписьКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаписьКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЗаписьКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаОказана</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<BasedOn>
				<xr:Item>Document.ЗаписьКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/МониторРуководителя/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПослеВводаПериода (Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> Неопределено Тогда
		ПериодОбработки = НачалоМесяца(Результат);
		МесяцСтрокой = Формат(ПериодОбработки, "ДФ='ММММ гггг'");
	КонецЕсли;
	ЗаполнитьГисторграммуВыручкаПоДням();
	ЗаполнитьДиаграммуПоИсточникамИнф();
	ЗаполнитьДиаграммуВыручкаПоСотрудникам();
	ЗаполнитьДиаграммуПоУслугам();
	ЗаполнитьЧисловыеПоказатели();
Конецпроцедуры

&НаКлиенте
Процедура МесяцСтрокойНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Подсказка = "Введите период получения данных";
	ЧастьДаты = ЧастиДаты.Дата;
	Оповещение = Новый ОписаниеОповещения("ПослеВводаПериода",ЭтотОбъект);
	ПоказатьВводДаты(Оповещение, ПериодОбработки, Подсказка, ЧастьДаты);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьГисторграммуВыручкаПоДням()
	ГистограммаВыручкаПоДням.Обновление = Ложь;
	ГистограммаВыручкаПоДням.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ) КАК Период,
	|	ПродажиОбороты.СуммаОборот КАК СуммаОборот
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ
	|	СУММА(СуммаОборот)
	|ПО
	|	Период ПЕРИОДАМИ(ДЕНЬ, &НачалоПериода, &КонецПериода)";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодОбработки));
	Запрос.УстановитьПараметр("НачалоПериода", ПериодОбработки);
	
	Серия = ГистограммаВыручкаПоДням.Серии.Добавить("Оборот");
	Серия.Цвет = WebЦвета.ЛососьСветлый;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПериод = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Период","Все");
	
	Пока ВыборкаПериод.Следующий() Цикл
		Точка = ГистограммаВыручкаПоДням.Точки.Добавить(ВыборкаПериод.Период);
		Точка.Текст = Формат(ВыборкаПериод.Период, "ДФ='дд.ММ.гг'");
		Точка.Расшифровка = ВыборкаПериод.Период;
		Подсказка = "Выручка"+ВыборкаПериод.СуммаОборот+" на "+Формат(ВыборкаПериод.Период, "ДФ=дд.ММ.гг");
		ГистограммаВыручкаПоДням.УстановитьЗначение(Точка,Серия,ВыборкаПериод.СуммаОборот,Точка.Расшифровка,Подсказка);
	КонецЦикла;
	
	ГистограммаВыручкаПоДням.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПериодОбработки = НачалоМесяца(ТекущаяДата());
	МесяцСтрокой = Формат(ПериодОбработки, "ДФ = 'ММММ.гггг'");
	ЗаполнитьГисторграммуВыручкаПоДням();
	ЗаполнитьДиаграммуПоИсточникамИнф();
	ЗаполнитьДиаграммуВыручкаПоСотрудникам();
	ЗаполнитьДиаграммуПоУслугам();
	ЗаполнитьЧисловыеПоказатели();
	
	ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере();
	
	ДатаЗагрузкиНовостей = ТекущаяДата();
	КоличествоНовостей = 5;
	СтрокаПоиска = "Business";
	ЯзыкПоиска = "ru";
	
	ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере();
	ЗагрузитьНовостиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ЗаполнитьГисторграммуВыручкаПоДням();
	ЗаполнитьДиаграммуПоИсточникамИнф();
	ЗаполнитьДиаграммуВыручкаПоСотрудникам();
	ЗаполнитьДиаграммуПоУслугам();
	ЗаполнитьЧисловыеПоказатели();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуПоИсточникамИнф()
	ВизитыПоРекламнымИсточникам.Обновление = Ложь;
	ВизитыПоРекламнымИсточникам.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ПродажиОбороты.Клиент.Источник.Представление, ""Не указан"") КАК Источник,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажиОбороты.Регистратор) КАК Количество
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.СуммаОборот <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ЕСТЬNULL(ПродажиОбороты.Клиент.Источник.Представление, ""Не указан"")";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодОбработки));
	Запрос.УстановитьПараметр("НачалоПериода", ПериодОбработки);
	
	Точка = ВизитыПоРекламнымИсточникам.Точки.Добавить("Количество");
	Точка.Текст = "Количество";
	Точка.ПриоритетЦвета = Ложь;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Серия = ВизитыПоРекламнымИсточникам.Серии.Добавить(ВыборкаДетальныеЗаписи.Источник);
		ВизитыПоРекламнымИсточникам.УстановитьЗначение(Точка,Серия,ВыборкаДетальныеЗаписи.Количество,Строка(ВыборкаДетальныеЗаписи.Количество()));
	КонецЦикла;
	
	ВизитыПоРекламнымИсточникам.Обновление = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуВыручкаПоСотрудникам()
	ВыручкаПоСотрудникам.Обновление = Ложь;
	ВыручкаПоСотрудникам.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(Продажи.СуммаОборот) КАК Сумма,
	|	Продажи.Сотрудник.Представление КАК Сотрудник
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК Продажи
	|ГДЕ
	|	Продажи.СуммаОборот <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Сотрудник.Представление";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодОбработки));
	Запрос.УстановитьПараметр("НачалоПериода",ПериодОбработки);
	
	Точка = ВыручкаПоСотрудникам.Точки.Добавить("Сумма");
	Точка.Текст = "Сумма";
	Точка.ПриоритетЦвета = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Серия = ВыручкаПоСотрудникам.Серии.Добавить(Выборка.Сотрудник);
		ВыручкаПоСотрудникам.УстановитьЗначение(Точка,Серия,Выборка.Сумма,Строка(Выборка.Сумма));
		
	КонецЦикла;
	ВыручкаПоСотрудникам.Обновление = Истина;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДиаграммуПоУслугам()
	ВыручкаПоУслугам.Обновление = Ложь;
	ВыручкаПоУслугам.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Продажи.Номенклатура КАК Номенклатура,
	|	СУММА(Продажи.СуммаОборот) КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_КонкретныеУслуги
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК Продажи
	|ГДЕ
	|	Продажи.СуммаОборот <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_ВсеПродажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)) КАК ПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КонкретныеУслуги.Номенклатура КАК Номенклатура,
	|	ВТ_КонкретныеУслуги.СуммаОборот КАК СуммаПродажНоменклатуры,
	|	ВТ_ВсеПродажи.СуммаОборот КАК ОбщаяСуммаПоУслугам
	|ПОМЕСТИТЬ ВТ_Предытог
	|ИЗ
	|	ВТ_КонкретныеУслуги КАК ВТ_КонкретныеУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ВсеПродажи КАК ВТ_ВсеПродажи
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА 100 * ВТ_Предытог.СуммаПродажНоменклатуры / ВТ_Предытог.ОбщаяСуммаПоУслугам > 10
	|			ТОГДА ВТ_Предытог.Номенклатура.Представление
	|		ИНАЧЕ ""Прочее""
	|	КОНЕЦ КАК Номенклатура,
	|	СУММА(ВТ_Предытог.СуммаПродажНоменклатуры) КАК Сумма
	|ИЗ
	|	ВТ_Предытог КАК ВТ_Предытог
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА 100 * ВТ_Предытог.СуммаПродажНоменклатуры / ВТ_Предытог.ОбщаяСуммаПоУслугам > 10
	|			ТОГДА ВТ_Предытог.Номенклатура.Представление
	|		ИНАЧЕ ""Прочее""
	|	КОНЕЦ";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодОбработки));
	Запрос.УстановитьПараметр("НачалоПериода",ПериодОбработки);
	
	Точка = ВыручкаПоУслугам.Точки.Добавить("Сумма");
	Точка.Текст = "Скмма";
	Точка.ПриоритетЦвета = Ложь;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Серия = ВыручкаПоУслугам.Серии.Добавить(Выборка.Номенклатура);
		ВыручкаПоУслугам.УстановитьЗначение(Точка,Серия,Выборка.Сумма,Строка(Выборка.Сумма));
	КонецЦикла;
	
	ВыручкаПоУслугам.Обновление = Истина;
	
КонецПроцедуры

Процедура ЗаполнитьЧисловыеПоказатели()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПродажиОбороты.Регистратор КАК Регистратор,
	|	ПродажиОбороты.СуммаОборот КАК СуммаОборот
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &Конецпериода, Регистратор, ) КАК ПродажиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Продажи.СуммаОборот) КАК СуммаОборот
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Продажи.СуммаОборот) КАК СуммаОборот,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Продажи.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ВТ_КоличествоРегистраторов
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|	КОГДА ВТ_КоличествоРегистраторов.Регистратор = 0
	|	ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ВТ_КоличествоРегистраторов.СуммаОборот / ВТ_КоличествоРегистраторов.Регистратор КАК ЧИСЛО(10, 2))
	|	КОНЕЦ КАК СреднийЧек
	|ИЗ
	|	ВТ_КоличествоРегистраторов КАК ВТ_КоличествоРегистраторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказыКлиентов.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_ЗаписиКлиентов
	|ИЗ
	|	РегистрНакопления.ЗаказыКлиентов КАК ЗаказыКлиентов
	|ГДЕ
	|	ЗаказыКлиентов.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗаказыКлиентов.Регистратор ССЫЛКА Документ.ЗаписьКлиента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗаписиКлиентов.Регистратор) КАК КоличествоЗаписейКлиентов
	|ИЗ
	|	ВТ_ЗаписиКлиентов КАК ВТ_ЗаписиКлиентов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ЗаписиКлиентов.Регистратор) КАК Завершенных
	|ИЗ
	|	ВТ_ЗаписиКлиентов КАК ВТ_ЗаписиКлиентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|		ПО ВТ_ЗаписиКлиентов.Регистратор = РеализацияТоваровИУслуг.Основание
	|ГДЕ
	|	РеализацияТоваровИУслуг.Проведен";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(ПериодОбработки));
	Запрос.УстановитьПараметр("НачалоПериода", ПериодОбработки);
	
	РеквизитВсегоЗаписей = 0;
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	
	ВыборкаПродажи = РезультатПакет[1].Выбрать();
	Если ВыборкаПродажи.Следующий() Тогда
		РеквизитВыручка = ВыборкаПродажи.Суммаоборот;
	КонецЕсли;
	
	ВыборкаСреднийЧек = РезультатПакет[3].Выбрать();
	Если ВыборкаСреднийЧек.Следующий() Тогда
		РеквизитСреднийЧек = ВыборкаСреднийЧек.СреднийЧек;
	КонецЕсли;
	
	ВыборкаЗаписиКлиента = РезультатПакет[5].Выбрать();
	Если ВыборкаЗаписиКлиента.Следующий() Тогда
		РеквизитВсегоЗаписей = ВыборкаЗаписиКлиента.КоличествоЗаписейКлиентов;
	КонецЕсли;
	
	ВыборкаЗаписиКлиентаЗав = РезультатПакет[6].Выбрать();
	Если ВыборкаЗаписиКлиентаЗав.Следующий() Тогда
		РеквизитЗавершенных = ВыборкаЗаписиКлиентаЗав.Завершенных;
		Если РеквизитВсегоЗаписей > 0 Тогда
			ПроцентЗавершенных = ОКР((100*РеквизитЗавершенных/РеквизитВсегоЗаписей),2);
			РеквизитПроцентЗавершенных = СтрШаблон("Это %1 процентов от всех записей", ПроцентЗавершенных);
		Иначе
			РеквизитПроцентЗавершенных = "В этом периоде нет записей клиентов!";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКурсВалют(Команда)
	ОбновитьКурсВалютНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКурсВалютНаСервере()
	ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере();
	ЗагрузитьНовостиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьКурсыВалютПоДаннымЦентробанкаНаСервере()

Сервер = "cbr.ru";
АдресЗапроса = "/scripts/XML_daily.asp?date_req=" + Формат(ТекущаяДата(), "ДФ=dd/MM/yyyy");

ВозвращаемоеЗначение = РаботаСHTTP.ПолучитьДанныеИзСервиса(Сервер, АдресЗапроса);

Если ВозвращаемоеЗначение.УспешныйЗапрос = Ложь Тогда
    Сообщить(ВозвращаемоеЗначение.ТекстОшибки);
    возврат;
ИначеЕсли ВозвращаемоеЗначение.HTTPОтвет.КодСостояния <> 200 Тогда
    Сообщить(СтрШаблон("Код вернул код состояния, отличный от 200: %1", ВозвращаемоеЗначение.HTTPОтвет.КодСостояния));
    возврат;
КонецЕсли;

СтрокаXML = ВозвращаемоеЗначение.HTTPОтвет.ПолучитьТелоКакСтроку();
ПрочитатьИзXMLПоследовательно(СтрокаXML);

КонецПроцедуры

&НаСервере
Процедура ПрочитатьИзXMLПоследовательно(СтрокаXML)
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(СтрокаXML);
	
	Валюта = Неопределено;
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			НужнаяВалюта = Ложь;
			
			Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
				Если  ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01235" Тогда
					Валюта = "USD";
				ИначеЕсли ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01239" Тогда
					Валюта = "EURO";
				ИначеЕсли ЧтениеXML.Имя = "ID" И ЧтениеXML.Значение = "R01335" Тогда
					Валюта = "TENGE";
				Иначе
					Валюта = Неопределено;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Валюта <> Неопределено
			И ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента
			И ЧтениеXML.Имя = "VunitRate" Тогда
			ЧтениеXML.Прочитать();
			Если Валюта = "USD" Тогда
				КурсДоллараНаСегодня = ЧтениеXML.Значение;
			ИначеЕсли Валюта = "EURO" Тогда
				КурсЕвроНаСегодня = ЧтениеXML.Значение;
			ИначеЕсли Валюта = "TENGE" Тогда
				КурсТенгеНаСегодня = ЧтениеXML.Значение*100;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНовостиНаСервере()
	ТопНовости = "";
	
	Сервер = "newsapi.org"; 
	АдресЗапроса = "/v2/everything";
	ПараметрыЗапроса = СтрШаблон("apiKey=%1&sortBy=popularity&from=%2&q=%3&language=%4", СокрЛП(Константы.API_KEY_newsapi.Получить()),
	Формат(ДатаЗагрузкиНовостей, "ДФ=yyyy-MM-dd"), СокрЛП(СтрокаПоиска), СокрЛП(ЯзыкПоиска));
	
	АдресЗапроса = АдресЗапроса + "?" + ПараметрыЗапроса;	
	ВозвращаемоеЗначение = РаботаСHTTP.ПолучитьДанныеИзСервиса(Сервер, АдресЗапроса);
	
	Если ВозвращаемоеЗначение.УспешныйЗапрос = Ложь Тогда
		Сообщить(ВозвращаемоеЗначение.ТекстОшибки);
		возврат;
	ИначеЕсли ВозвращаемоеЗначение.HTTPОтвет.КодСостояния <> 200 Тогда
		Сообщить(СтрШаблон("Код вернул код состояния, отличный от 200: %1", ВозвращаемоеЗначение.HTTPОтвет.КодСостояния));
		возврат;
	КонецЕсли;
	
	СтрокаJSON = ВозвращаемоеЗначение.HTTPОтвет.ПолучитьТелоКакСтроку();	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Новости = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();
	
	Итератор = 1;
	
	Если Новости <> Неопределено Тогда
		Для Каждого Статья Из Новости.articles Цикл
			ТопНовости = ТопНовости + Строка(Итератор) + ") " + "Источник: " + Статья.url + Символы.ПС + Статья.title + Символы.ПС;
			ТопНовости = ТопНовости + Статья.description + Символы.ПС + Символы.ПС;
			Если Итератор = КоличествоНовостей Тогда
				прервать;
			КонецЕсли;
			Итератор = Итератор + 1;
		КонецЦикла;
	Конецесли;
КонецПроцедуры
